using ImpostorHelp.Context;

namespace ImpostorHelp.Database.Repositories;

public class SupportingTextFactsRepository
{
    private Random _random;
    private string text1 = "Компания Asana, создающая IT-решения для управления в бизнесе, опросила 13 000 офисных работников в Австралии, Новой Зеландии, Франции, Германии, Японии, Сингапуре, Великобритании и США. В своём отчете «Работа: взгляд изнутри 2021» эксперты Asana отмечают, что почти две трети (62%) респондентов испытывают синдром самозванца. 62% из 13 000 опрошенных кажется, что они не смыслят в своей профессии и делают свою работу недостаточно хорошо. Однако их компании работают и достигают успеха: если бы так много людей были такими бесполезными на своих рабочих местах, вряд ли бы компании держались на плаву…";
    private string text2 = "Я хочу поделиться с тобой результатами исследования «Работа: взгляд изнутри 2021», проведенного компанией Asana. Интересно, что 47% опрошенных (а всего в исследовании участвовало 13 000 офисных сотрудников) сообщили о том, что в 2020 году чувство самозванчества усилилось по сравнению с предыдущими годами. Авторы исследования связывают это с влиянием пандемии, в условиях которой, во-первых, коллеги были разъединены и не могли оперативно советоваться по сложным вопросам и решать проблемы сообща. А во-вторых, при работе на удалёнке не всегда удается порадоваться совместным успехам, оценить вклад каждого в общее дело. Похоже, синдром самозванца сильно зависит от того, в какой среде человек находится. Если в своей работе ты редко получаешь поддержку и в твоей компании не принято отмечать ценность каждого сотрудника, это может усиливать переживания синдрома самозванца. Помни, что твоё самочувствие зависит не только от того, что ты сам делаешь, но и от того, в каком окружении ты находишься.";
    private string text3 = "Любопытная особенность синдрома самозванца в том, что от него страдают не только новички в своем деле. Те, кто занимают более высокие должности, с большой вероятностью испытают чувство самозванчества. Казалось бы, человек, который достиг большого успеха в профессии, не должен в себе сомневаться – ведь он настолько крут, что это признает социум. Но хитрый синдром самозванца устроен по принципу, который описал ещё Сократ (а может быть, Демокрит): «Чем больше я знаю, тем больше я понимаю, что ничего не знаю». Чем лучше ты разбираешься в своей сфере, чем вдумчивее относишься к своему делу, тем больше ты осознаешь, как много сложностей и нюансов существует, как много ещё надо изучить и попробовать, чтобы делать своё дело на 5+. Получается, что синдром самозванца может фактически говорить об обратном: то, насколько ты осознаешь границы своей компетентности, указывает на то, что твоя компетентность уже довольно высока!";
    private string text4 = "Мы часто ставим себя в ситуацию неадекватного сравнения. Смотрим соцсети супер-мега-успешных людей, в конкуренции с образами которых у нас нет ни единого шанса. Однако сами успешные люди тоже страдают синдромом самозванца! Например, Мерил Стрип как-то поделилась таким признанием: «Ты думаешь: „С чего люди вообще должны захотеть увидеть меня ещё в одном фильме? Я всё равно не умею играть, так почему я этим занимаюсь?“». Даже если ты не фанат Мерил Стрип, думаю, тебя всё равно удивили такие слова из уст одной из величайших актрис Голливуда. Похоже, успешные личности – такие же живые люди, которые каждый день делают простые вещи и сталкиваются с разными сложностями. Неважно, насколько успешным человек становится, если он привык обесценивать свои достижения, к сожалению, он будет это делать и на самых высоких позициях. Так что лучше уже сейчас научиться радоваться за свои успехи и прощать себе неудачи ;)";
    private string text5 = "Снятый по мотивам рассказов Михаила Булгакова сериал “Записки юного врача” с Дэниелом Рэдклиффом в главной роли во многом описывает переживания, свойственные самозванцу. На протяжении двух сезонов главный герой борется сомнениями в собственной компетентности. Причём претензии к профессионализму озвучиваются от окружающих людей (коллег и пациентов), так и возникают внутри самого юного врача. Можно взять на заметку некоторые (но не все!) приёмы, которыми спасается молодой человек. Дополнительным инструментом помощи станет чёрный юмор - которого хватает и у Булгакова, и у авторов сериала.";
    
    public string GetTextFromDb()
    {
        _random = new Random();
        var list = new List<string>();
        list.Add(text1);
        list.Add(text2);
        list.Add(text3);
        list.Add(text4);
        list.Add(text5);
        return list[_random.Next(list.Count)];
    }
}